----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 64, 64, 128]           9,408
            Conv2d-2          [-1, 64, 64, 128]           9,408
       BatchNorm2d-3          [-1, 64, 64, 128]             128
       BatchNorm2d-4          [-1, 64, 64, 128]             128
              ReLU-5          [-1, 64, 64, 128]               0
              ReLU-6          [-1, 64, 64, 128]               0
         MaxPool2d-7           [-1, 64, 32, 64]               0
         MaxPool2d-8           [-1, 64, 32, 64]               0
            Conv2d-9           [-1, 64, 32, 64]           4,096
           Conv2d-10           [-1, 64, 32, 64]           4,096
      BatchNorm2d-11           [-1, 64, 32, 64]             128
      BatchNorm2d-12           [-1, 64, 32, 64]             128
             ReLU-13           [-1, 64, 32, 64]               0
             ReLU-14           [-1, 64, 32, 64]               0
           Conv2d-15           [-1, 64, 32, 64]          36,864
           Conv2d-16           [-1, 64, 32, 64]          36,864
      BatchNorm2d-17           [-1, 64, 32, 64]             128
      BatchNorm2d-18           [-1, 64, 32, 64]             128
             ReLU-19           [-1, 64, 32, 64]               0
             ReLU-20           [-1, 64, 32, 64]               0
           Conv2d-21          [-1, 256, 32, 64]          16,384
           Conv2d-22          [-1, 256, 32, 64]          16,384
      BatchNorm2d-23          [-1, 256, 32, 64]             512
      BatchNorm2d-24          [-1, 256, 32, 64]             512
           Conv2d-25          [-1, 256, 32, 64]          16,384
           Conv2d-26          [-1, 256, 32, 64]          16,384
      BatchNorm2d-27          [-1, 256, 32, 64]             512
      BatchNorm2d-28          [-1, 256, 32, 64]             512
             ReLU-29          [-1, 256, 32, 64]               0
             ReLU-30          [-1, 256, 32, 64]               0
       Bottleneck-31          [-1, 256, 32, 64]               0
       Bottleneck-32          [-1, 256, 32, 64]               0
           Conv2d-33           [-1, 64, 32, 64]          16,384
           Conv2d-34           [-1, 64, 32, 64]          16,384
      BatchNorm2d-35           [-1, 64, 32, 64]             128
      BatchNorm2d-36           [-1, 64, 32, 64]             128
             ReLU-37           [-1, 64, 32, 64]               0
             ReLU-38           [-1, 64, 32, 64]               0
           Conv2d-39           [-1, 64, 32, 64]          36,864
           Conv2d-40           [-1, 64, 32, 64]          36,864
      BatchNorm2d-41           [-1, 64, 32, 64]             128
      BatchNorm2d-42           [-1, 64, 32, 64]             128
             ReLU-43           [-1, 64, 32, 64]               0
             ReLU-44           [-1, 64, 32, 64]               0
           Conv2d-45          [-1, 256, 32, 64]          16,384
           Conv2d-46          [-1, 256, 32, 64]          16,384
      BatchNorm2d-47          [-1, 256, 32, 64]             512
      BatchNorm2d-48          [-1, 256, 32, 64]             512
             ReLU-49          [-1, 256, 32, 64]               0
             ReLU-50          [-1, 256, 32, 64]               0
       Bottleneck-51          [-1, 256, 32, 64]               0
       Bottleneck-52          [-1, 256, 32, 64]               0
           Conv2d-53           [-1, 64, 32, 64]          16,384
           Conv2d-54           [-1, 64, 32, 64]          16,384
      BatchNorm2d-55           [-1, 64, 32, 64]             128
      BatchNorm2d-56           [-1, 64, 32, 64]             128
             ReLU-57           [-1, 64, 32, 64]               0
             ReLU-58           [-1, 64, 32, 64]               0
           Conv2d-59           [-1, 64, 32, 64]          36,864
           Conv2d-60           [-1, 64, 32, 64]          36,864
      BatchNorm2d-61           [-1, 64, 32, 64]             128
      BatchNorm2d-62           [-1, 64, 32, 64]             128
             ReLU-63           [-1, 64, 32, 64]               0
             ReLU-64           [-1, 64, 32, 64]               0
           Conv2d-65          [-1, 256, 32, 64]          16,384
           Conv2d-66          [-1, 256, 32, 64]          16,384
      BatchNorm2d-67          [-1, 256, 32, 64]             512
      BatchNorm2d-68          [-1, 256, 32, 64]             512
             ReLU-69          [-1, 256, 32, 64]               0
             ReLU-70          [-1, 256, 32, 64]               0
       Bottleneck-71          [-1, 256, 32, 64]               0
       Bottleneck-72          [-1, 256, 32, 64]               0
           Conv2d-73          [-1, 128, 32, 64]          32,768
           Conv2d-74          [-1, 128, 32, 64]          32,768
      BatchNorm2d-75          [-1, 128, 32, 64]             256
      BatchNorm2d-76          [-1, 128, 32, 64]             256
             ReLU-77          [-1, 128, 32, 64]               0
             ReLU-78          [-1, 128, 32, 64]               0
           Conv2d-79          [-1, 128, 16, 32]         147,456
           Conv2d-80          [-1, 128, 16, 32]         147,456
      BatchNorm2d-81          [-1, 128, 16, 32]             256
      BatchNorm2d-82          [-1, 128, 16, 32]             256
             ReLU-83          [-1, 128, 16, 32]               0
             ReLU-84          [-1, 128, 16, 32]               0
           Conv2d-85          [-1, 512, 16, 32]          65,536
           Conv2d-86          [-1, 512, 16, 32]          65,536
      BatchNorm2d-87          [-1, 512, 16, 32]           1,024
      BatchNorm2d-88          [-1, 512, 16, 32]           1,024
           Conv2d-89          [-1, 512, 16, 32]         131,072
           Conv2d-90          [-1, 512, 16, 32]         131,072
      BatchNorm2d-91          [-1, 512, 16, 32]           1,024
      BatchNorm2d-92          [-1, 512, 16, 32]           1,024
             ReLU-93          [-1, 512, 16, 32]               0
             ReLU-94          [-1, 512, 16, 32]               0
       Bottleneck-95          [-1, 512, 16, 32]               0
       Bottleneck-96          [-1, 512, 16, 32]               0
           Conv2d-97          [-1, 128, 16, 32]          65,536
           Conv2d-98          [-1, 128, 16, 32]          65,536
      BatchNorm2d-99          [-1, 128, 16, 32]             256
     BatchNorm2d-100          [-1, 128, 16, 32]             256
            ReLU-101          [-1, 128, 16, 32]               0
            ReLU-102          [-1, 128, 16, 32]               0
          Conv2d-103          [-1, 128, 16, 32]         147,456
          Conv2d-104          [-1, 128, 16, 32]         147,456
     BatchNorm2d-105          [-1, 128, 16, 32]             256
     BatchNorm2d-106          [-1, 128, 16, 32]             256
            ReLU-107          [-1, 128, 16, 32]               0
            ReLU-108          [-1, 128, 16, 32]               0
          Conv2d-109          [-1, 512, 16, 32]          65,536
          Conv2d-110          [-1, 512, 16, 32]          65,536
     BatchNorm2d-111          [-1, 512, 16, 32]           1,024
     BatchNorm2d-112          [-1, 512, 16, 32]           1,024
            ReLU-113          [-1, 512, 16, 32]               0
            ReLU-114          [-1, 512, 16, 32]               0
      Bottleneck-115          [-1, 512, 16, 32]               0
      Bottleneck-116          [-1, 512, 16, 32]               0
          Conv2d-117          [-1, 128, 16, 32]          65,536
          Conv2d-118          [-1, 128, 16, 32]          65,536
     BatchNorm2d-119          [-1, 128, 16, 32]             256
     BatchNorm2d-120          [-1, 128, 16, 32]             256
            ReLU-121          [-1, 128, 16, 32]               0
            ReLU-122          [-1, 128, 16, 32]               0
          Conv2d-123          [-1, 128, 16, 32]         147,456
          Conv2d-124          [-1, 128, 16, 32]         147,456
     BatchNorm2d-125          [-1, 128, 16, 32]             256
     BatchNorm2d-126          [-1, 128, 16, 32]             256
            ReLU-127          [-1, 128, 16, 32]               0
            ReLU-128          [-1, 128, 16, 32]               0
          Conv2d-129          [-1, 512, 16, 32]          65,536
          Conv2d-130          [-1, 512, 16, 32]          65,536
     BatchNorm2d-131          [-1, 512, 16, 32]           1,024
     BatchNorm2d-132          [-1, 512, 16, 32]           1,024
            ReLU-133          [-1, 512, 16, 32]               0
            ReLU-134          [-1, 512, 16, 32]               0
      Bottleneck-135          [-1, 512, 16, 32]               0
      Bottleneck-136          [-1, 512, 16, 32]               0
          Conv2d-137          [-1, 128, 16, 32]          65,536
          Conv2d-138          [-1, 128, 16, 32]          65,536
     BatchNorm2d-139          [-1, 128, 16, 32]             256
     BatchNorm2d-140          [-1, 128, 16, 32]             256
            ReLU-141          [-1, 128, 16, 32]               0
            ReLU-142          [-1, 128, 16, 32]               0
          Conv2d-143          [-1, 128, 16, 32]         147,456
          Conv2d-144          [-1, 128, 16, 32]         147,456
     BatchNorm2d-145          [-1, 128, 16, 32]             256
     BatchNorm2d-146          [-1, 128, 16, 32]             256
            ReLU-147          [-1, 128, 16, 32]               0
            ReLU-148          [-1, 128, 16, 32]               0
          Conv2d-149          [-1, 512, 16, 32]          65,536
          Conv2d-150          [-1, 512, 16, 32]          65,536
     BatchNorm2d-151          [-1, 512, 16, 32]           1,024
     BatchNorm2d-152          [-1, 512, 16, 32]           1,024
            ReLU-153          [-1, 512, 16, 32]               0
            ReLU-154          [-1, 512, 16, 32]               0
      Bottleneck-155          [-1, 512, 16, 32]               0
      Bottleneck-156          [-1, 512, 16, 32]               0
          Conv2d-157          [-1, 256, 16, 32]         131,072
          Conv2d-158          [-1, 256, 16, 32]         131,072
     BatchNorm2d-159          [-1, 256, 16, 32]             512
     BatchNorm2d-160          [-1, 256, 16, 32]             512
            ReLU-161          [-1, 256, 16, 32]               0
            ReLU-162          [-1, 256, 16, 32]               0
          Conv2d-163           [-1, 256, 8, 16]         589,824
          Conv2d-164           [-1, 256, 8, 16]         589,824
     BatchNorm2d-165           [-1, 256, 8, 16]             512
     BatchNorm2d-166           [-1, 256, 8, 16]             512
            ReLU-167           [-1, 256, 8, 16]               0
            ReLU-168           [-1, 256, 8, 16]               0
          Conv2d-169          [-1, 1024, 8, 16]         262,144
          Conv2d-170          [-1, 1024, 8, 16]         262,144
     BatchNorm2d-171          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-172          [-1, 1024, 8, 16]           2,048
          Conv2d-173          [-1, 1024, 8, 16]         524,288
          Conv2d-174          [-1, 1024, 8, 16]         524,288
     BatchNorm2d-175          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-176          [-1, 1024, 8, 16]           2,048
            ReLU-177          [-1, 1024, 8, 16]               0
            ReLU-178          [-1, 1024, 8, 16]               0
      Bottleneck-179          [-1, 1024, 8, 16]               0
      Bottleneck-180          [-1, 1024, 8, 16]               0
          Conv2d-181           [-1, 256, 8, 16]         262,144
          Conv2d-182           [-1, 256, 8, 16]         262,144
     BatchNorm2d-183           [-1, 256, 8, 16]             512
     BatchNorm2d-184           [-1, 256, 8, 16]             512
            ReLU-185           [-1, 256, 8, 16]               0
            ReLU-186           [-1, 256, 8, 16]               0
          Conv2d-187           [-1, 256, 8, 16]         589,824
          Conv2d-188           [-1, 256, 8, 16]         589,824
     BatchNorm2d-189           [-1, 256, 8, 16]             512
     BatchNorm2d-190           [-1, 256, 8, 16]             512
            ReLU-191           [-1, 256, 8, 16]               0
            ReLU-192           [-1, 256, 8, 16]               0
          Conv2d-193          [-1, 1024, 8, 16]         262,144
          Conv2d-194          [-1, 1024, 8, 16]         262,144
     BatchNorm2d-195          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-196          [-1, 1024, 8, 16]           2,048
            ReLU-197          [-1, 1024, 8, 16]               0
            ReLU-198          [-1, 1024, 8, 16]               0
      Bottleneck-199          [-1, 1024, 8, 16]               0
      Bottleneck-200          [-1, 1024, 8, 16]               0
          Conv2d-201           [-1, 256, 8, 16]         262,144
          Conv2d-202           [-1, 256, 8, 16]         262,144
     BatchNorm2d-203           [-1, 256, 8, 16]             512
     BatchNorm2d-204           [-1, 256, 8, 16]             512
            ReLU-205           [-1, 256, 8, 16]               0
            ReLU-206           [-1, 256, 8, 16]               0
          Conv2d-207           [-1, 256, 8, 16]         589,824
          Conv2d-208           [-1, 256, 8, 16]         589,824
     BatchNorm2d-209           [-1, 256, 8, 16]             512
     BatchNorm2d-210           [-1, 256, 8, 16]             512
            ReLU-211           [-1, 256, 8, 16]               0
            ReLU-212           [-1, 256, 8, 16]               0
          Conv2d-213          [-1, 1024, 8, 16]         262,144
          Conv2d-214          [-1, 1024, 8, 16]         262,144
     BatchNorm2d-215          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-216          [-1, 1024, 8, 16]           2,048
            ReLU-217          [-1, 1024, 8, 16]               0
            ReLU-218          [-1, 1024, 8, 16]               0
      Bottleneck-219          [-1, 1024, 8, 16]               0
      Bottleneck-220          [-1, 1024, 8, 16]               0
          Conv2d-221           [-1, 256, 8, 16]         262,144
          Conv2d-222           [-1, 256, 8, 16]         262,144
     BatchNorm2d-223           [-1, 256, 8, 16]             512
     BatchNorm2d-224           [-1, 256, 8, 16]             512
            ReLU-225           [-1, 256, 8, 16]               0
            ReLU-226           [-1, 256, 8, 16]               0
          Conv2d-227           [-1, 256, 8, 16]         589,824
          Conv2d-228           [-1, 256, 8, 16]         589,824
     BatchNorm2d-229           [-1, 256, 8, 16]             512
     BatchNorm2d-230           [-1, 256, 8, 16]             512
            ReLU-231           [-1, 256, 8, 16]               0
            ReLU-232           [-1, 256, 8, 16]               0
          Conv2d-233          [-1, 1024, 8, 16]         262,144
          Conv2d-234          [-1, 1024, 8, 16]         262,144
     BatchNorm2d-235          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-236          [-1, 1024, 8, 16]           2,048
            ReLU-237          [-1, 1024, 8, 16]               0
            ReLU-238          [-1, 1024, 8, 16]               0
      Bottleneck-239          [-1, 1024, 8, 16]               0
      Bottleneck-240          [-1, 1024, 8, 16]               0
          Conv2d-241           [-1, 256, 8, 16]         262,144
          Conv2d-242           [-1, 256, 8, 16]         262,144
     BatchNorm2d-243           [-1, 256, 8, 16]             512
     BatchNorm2d-244           [-1, 256, 8, 16]             512
            ReLU-245           [-1, 256, 8, 16]               0
            ReLU-246           [-1, 256, 8, 16]               0
          Conv2d-247           [-1, 256, 8, 16]         589,824
          Conv2d-248           [-1, 256, 8, 16]         589,824
     BatchNorm2d-249           [-1, 256, 8, 16]             512
     BatchNorm2d-250           [-1, 256, 8, 16]             512
            ReLU-251           [-1, 256, 8, 16]               0
            ReLU-252           [-1, 256, 8, 16]               0
          Conv2d-253          [-1, 1024, 8, 16]         262,144
          Conv2d-254          [-1, 1024, 8, 16]         262,144
     BatchNorm2d-255          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-256          [-1, 1024, 8, 16]           2,048
            ReLU-257          [-1, 1024, 8, 16]               0
            ReLU-258          [-1, 1024, 8, 16]               0
      Bottleneck-259          [-1, 1024, 8, 16]               0
      Bottleneck-260          [-1, 1024, 8, 16]               0
          Conv2d-261           [-1, 256, 8, 16]         262,144
          Conv2d-262           [-1, 256, 8, 16]         262,144
     BatchNorm2d-263           [-1, 256, 8, 16]             512
     BatchNorm2d-264           [-1, 256, 8, 16]             512
            ReLU-265           [-1, 256, 8, 16]               0
            ReLU-266           [-1, 256, 8, 16]               0
          Conv2d-267           [-1, 256, 8, 16]         589,824
          Conv2d-268           [-1, 256, 8, 16]         589,824
     BatchNorm2d-269           [-1, 256, 8, 16]             512
     BatchNorm2d-270           [-1, 256, 8, 16]             512
            ReLU-271           [-1, 256, 8, 16]               0
            ReLU-272           [-1, 256, 8, 16]               0
          Conv2d-273          [-1, 1024, 8, 16]         262,144
          Conv2d-274          [-1, 1024, 8, 16]         262,144
     BatchNorm2d-275          [-1, 1024, 8, 16]           2,048
     BatchNorm2d-276          [-1, 1024, 8, 16]           2,048
            ReLU-277          [-1, 1024, 8, 16]               0
            ReLU-278          [-1, 1024, 8, 16]               0
      Bottleneck-279          [-1, 1024, 8, 16]               0
      Bottleneck-280          [-1, 1024, 8, 16]               0
          Conv2d-281           [-1, 512, 8, 16]         524,288
          Conv2d-282           [-1, 512, 8, 16]         524,288
     BatchNorm2d-283           [-1, 512, 8, 16]           1,024
     BatchNorm2d-284           [-1, 512, 8, 16]           1,024
            ReLU-285           [-1, 512, 8, 16]               0
            ReLU-286           [-1, 512, 8, 16]               0
          Conv2d-287            [-1, 512, 4, 8]       2,359,296
          Conv2d-288            [-1, 512, 4, 8]       2,359,296
     BatchNorm2d-289            [-1, 512, 4, 8]           1,024
     BatchNorm2d-290            [-1, 512, 4, 8]           1,024
            ReLU-291            [-1, 512, 4, 8]               0
            ReLU-292            [-1, 512, 4, 8]               0
          Conv2d-293           [-1, 2048, 4, 8]       1,048,576
          Conv2d-294           [-1, 2048, 4, 8]       1,048,576
     BatchNorm2d-295           [-1, 2048, 4, 8]           4,096
     BatchNorm2d-296           [-1, 2048, 4, 8]           4,096
          Conv2d-297           [-1, 2048, 4, 8]       2,097,152
          Conv2d-298           [-1, 2048, 4, 8]       2,097,152
     BatchNorm2d-299           [-1, 2048, 4, 8]           4,096
     BatchNorm2d-300           [-1, 2048, 4, 8]           4,096
            ReLU-301           [-1, 2048, 4, 8]               0
            ReLU-302           [-1, 2048, 4, 8]               0
      Bottleneck-303           [-1, 2048, 4, 8]               0
      Bottleneck-304           [-1, 2048, 4, 8]               0
          Conv2d-305            [-1, 512, 4, 8]       1,048,576
          Conv2d-306            [-1, 512, 4, 8]       1,048,576
     BatchNorm2d-307            [-1, 512, 4, 8]           1,024
     BatchNorm2d-308            [-1, 512, 4, 8]           1,024
            ReLU-309            [-1, 512, 4, 8]               0
            ReLU-310            [-1, 512, 4, 8]               0
          Conv2d-311            [-1, 512, 4, 8]       2,359,296
          Conv2d-312            [-1, 512, 4, 8]       2,359,296
     BatchNorm2d-313            [-1, 512, 4, 8]           1,024
     BatchNorm2d-314            [-1, 512, 4, 8]           1,024
            ReLU-315            [-1, 512, 4, 8]               0
            ReLU-316            [-1, 512, 4, 8]               0
          Conv2d-317           [-1, 2048, 4, 8]       1,048,576
          Conv2d-318           [-1, 2048, 4, 8]       1,048,576
     BatchNorm2d-319           [-1, 2048, 4, 8]           4,096
     BatchNorm2d-320           [-1, 2048, 4, 8]           4,096
            ReLU-321           [-1, 2048, 4, 8]               0
            ReLU-322           [-1, 2048, 4, 8]               0
      Bottleneck-323           [-1, 2048, 4, 8]               0
      Bottleneck-324           [-1, 2048, 4, 8]               0
          Conv2d-325            [-1, 512, 4, 8]       1,048,576
          Conv2d-326            [-1, 512, 4, 8]       1,048,576
     BatchNorm2d-327            [-1, 512, 4, 8]           1,024
     BatchNorm2d-328            [-1, 512, 4, 8]           1,024
            ReLU-329            [-1, 512, 4, 8]               0
            ReLU-330            [-1, 512, 4, 8]               0
          Conv2d-331            [-1, 512, 4, 8]       2,359,296
          Conv2d-332            [-1, 512, 4, 8]       2,359,296
     BatchNorm2d-333            [-1, 512, 4, 8]           1,024
     BatchNorm2d-334            [-1, 512, 4, 8]           1,024
            ReLU-335            [-1, 512, 4, 8]               0
            ReLU-336            [-1, 512, 4, 8]               0
          Conv2d-337           [-1, 2048, 4, 8]       1,048,576
          Conv2d-338           [-1, 2048, 4, 8]       1,048,576
     BatchNorm2d-339           [-1, 2048, 4, 8]           4,096
     BatchNorm2d-340           [-1, 2048, 4, 8]           4,096
            ReLU-341           [-1, 2048, 4, 8]               0
            ReLU-342           [-1, 2048, 4, 8]               0
      Bottleneck-343           [-1, 2048, 4, 8]               0
      Bottleneck-344           [-1, 2048, 4, 8]               0
AdaptiveAvgPool2d-345           [-1, 2048, 1, 1]               0
AdaptiveAvgPool2d-346           [-1, 2048, 1, 1]               0
            ReLU-347                 [-1, 2048]               0
            ReLU-348                 [-1, 2048]               0
          Linear-349                   [-1, 18]          36,882
================================================================
Total params: 47,052,946
Trainable params: 47,052,946
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.38
Forward/backward pass size (MB): 374.31
Params size (MB): 179.49
Estimated Total Size (MB): 554.18
----------------------------------------------------------------
